app/controllers/personalities_controller.rb

  def create
    @personality = Personality.new(personality_params)
    if @personality.save
      type = PersonalityType.find_by(name: @personality.type)
---
INSERT INTO "personalities" ("user_id", "intro_extroversion", "sensing_intuition", "thinking_feeling", "judging_perceiving") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["intro_extroversion", "I"], ["sensing_intuition", "N"], ["thinking_feeling", "F"], ["judging_perceiving", "P"]]
SELECT  "personality_types".* FROM "personality_types" WHERE "personality_types"."name" = ? LIMIT ?  [["name", "ENTJ"], ["LIMIT", 1]]

  def edit
    @personality = Personality.find(params[:id])
---
SELECT  "personalities".* FROM "personalities" WHERE "personalities"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def update
    @personality = Personality.find(params[:id])
    @personality.update(personality_params)
---
SELECT  "personalities".* FROM "personalities" WHERE "personalities"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "personalities" SET "intro_extroversion" = ?, "judging_perceiving" = ? WHERE "personalities"."id" = ?  [["intro_extroversion", "I"], ["judging_perceiving", "P"], ["id", 3]]