app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @matches = Match.where(personality_type_id: @user.personality_type)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "matches".* FROM "matches" WHERE "matches"."personality_type_id" = 7
SELECT "users".* FROM "users" WHERE "users"."personality_type_id" = ?  [["personality_type_id", 16]]